[Survived] StringLiteral
src/app/message/message.component.ts:6:15
 @Component({
   selector: 'mutation-demo-message',
   templateUrl: './message.component.html',
-  styleUrls: ['./message.component.scss']
+  styleUrls: [""]
 })
 export class MessageComponent implements OnInit {

[Survived] ArrayLiteral
src/app/message/message.component.ts:6:14
 @Component({
   selector: 'mutation-demo-message',
   templateUrl: './message.component.html',
-  styleUrls: ['./message.component.scss']
+  styleUrls: []
 })
 export class MessageComponent implements OnInit {
