[Survived] ArrayLiteral
demo3/src/app/app.module.ts:9:14
 @NgModule({
   declarations: [AppComponent],
   imports: [BrowserModule],
-  providers: [],
+  providers: ['Stryker was here'],
   bootstrap: [AppComponent]
 })
