[Survived] ArrayLiteral
demo/src/app/app.module.ts:11:14
   declarations: [AppComponent, MessageComponent],
   imports: [BrowserModule],
   providers: [],
-  bootstrap: [AppComponent]
+  bootstrap: []
 })
 export class AppModule {}
