[Survived] ConditionalExpression
demo3/src/app/app.component.html:1:12
-<div style="text-align:center">
-  <h1>Welcome to {{ title }}!</h1>
+<div style=false to {{ title }}!</h1>
   <img
     width="450"

[Survived] BinaryExpression
demo3/src/app/app.component.html:1:31
-<div style="text-align:center">
+<div style="text-align:center"<=
   <h1>Welcome to {{ title }}!</h1>
   <img

[Survived] Block
demo3/src/app/app.component.html:2:19
 <div style="text-align:center">
-  <h1>Welcome to {{ title }}!</h1>
+  <h1>Welcome to {{}}!</h1>
   <img
     width="450"

[Survived] Block
demo3/src/app/app.component.html:2:18
 <div style="text-align:center">
-  <h1>Welcome to {{ title }}!</h1>
+  <h1>Welcome to {}!</h1>
   <img
     width="450"

[Survived] BinaryExpression
demo3/src/app/app.component.html:3:3
 <div style="text-align:center">
   <h1>Welcome to {{ title }}!</h1>
-  <img
+  <=img
     width="450"
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"

[Survived] BinaryExpression
demo3/src/app/app.component.html:3:3
 <div style="text-align:center">
   <h1>Welcome to {{ title }}!</h1>
-  <img
+  >=img
     width="450"
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"

[Survived] ConditionalExpression
demo3/src/app/app.component.html:4:5
 <div style="text-align:center">
   <h1>Welcome to {{ title }}!</h1>
   <img
-    width="450"
+    true
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
   />

[Survived] ConditionalExpression
demo3/src/app/app.component.html:4:5
 <div style="text-align:center">
   <h1>Welcome to {{ title }}!</h1>
   <img
-    width="450"
+    false
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
   />

[Survived] ConditionalExpression
demo3/src/app/app.component.html:5:9
   <h1>Welcome to {{ title }}!</h1>
   <img
     width="450"
-    src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
-  />
-</div>
-
-<p>
-  This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
+    src=false is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
 </p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:5:9
   <h1>Welcome to {{ title }}!</h1>
   <img
     width="450"
-    src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
-  />
-</div>
+    src=false
 
 <p>

[Survived] BinaryExpression
demo3/src/app/app.component.html:6:4
   <img
     width="450"
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
-  />
+  />=
 </div>
 

[Survived] BinaryExpression
demo3/src/app/app.component.html:6:4
   <img
     width="450"
     src="https://raw.githubusercontent.com/nrwl/nx/master/nx-logo.png"
-  />
+  /<=
 </div>
 

[Survived] BinaryExpression
demo3/src/app/app.component.html:9:3
   />
 </div>
 
-<p>
+<p>=
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
 </p>

[Survived] BinaryExpression
demo3/src/app/app.component.html:9:1
   />
 </div>
 
-<p>
+<=p>
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
 </p>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:10:44
 </div>
 
 <p>
-  This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
-</p>
-<p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
+  This is an Angular app built with <a hreftrue🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
 
 <h2>Quick Start & Documentation</h2>

[Survived] BinaryExpression
demo3/src/app/app.component.html:10:69
 </div>
 
 <p>
-  This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
+  This is an Angular app built with <a href="https://nx.dev/angular">=Nx</a>.
 </p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>

[Survived] BinaryExpression
demo3/src/app/app.component.html:11:1
 
 <p>
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
-</p>
+>=/p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
 

[Survived] BinaryExpression
demo3/src/app/app.component.html:11:1
 
 <p>
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
-</p>
+<=/p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
 

[Survived] ConditionalExpression
demo3/src/app/app.component.html:12:7
 <p>
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
 </p>
-<p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
+<p>🔎 *trueis a set of Extensible Dev Tools for Monorepos.**</p>
 
 <h2>Quick Start & Documentation</h2>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:12:7
 <p>
   This is an Angular app built with <a href="https://nx.dev/angular">Nx</a>.
 </p>
-<p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
+<p>🔎 *falseis a set of Extensible Dev Tools for Monorepos.**</p>
 
 <h2>Quick Start & Documentation</h2>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:14:19
 </p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
 
-<h2>Quick Start & Documentation</h2>
-
-<ul>
-  <li>
-    <a href="https://nx.dev/angular/getting-started/what-is-nx"
+<h2>Quick Start & true="https://nx.dev/angular/getting-started/what-is-nx"
       >10-minute video showing all Nx features</a
     >

[Survived] ConditionalExpression
demo3/src/app/app.component.html:14:19
 </p>
 <p>🔎 **Nx is a set of Extensible Dev Tools for Monorepos.**</p>
 
-<h2>Quick Start & Documentation</h2>
-
-<ul>
+<h2>Quick Start & true>
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"

[Survived] BinaryExpression
demo3/src/app/app.component.html:16:1
 
 <h2>Quick Start & Documentation</h2>
 
-<ul>
+<=ul>
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"

[Survived] BinaryExpression
demo3/src/app/app.component.html:16:4
 
 <h2>Quick Start & Documentation</h2>
 
-<ul>
+<ul>=
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"

[Survived] ConditionalExpression
demo3/src/app/app.component.html:18:13
 
 <ul>
   <li>
-    <a href="https://nx.dev/angular/getting-started/what-is-nx"
-      >10-minute video showing all Nx features</a
+    <a href=true video showing all Nx features</a
     >
   </li>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:18:13
 
 <ul>
   <li>
-    <a href="https://nx.dev/angular/getting-started/what-is-nx"
-      >10-minute video showing all Nx features</a
+    <a href=false video showing all Nx features</a
     >
   </li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:19:7
 <ul>
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"
-      >10-minute video showing all Nx features</a
+      >=10-minute video showing all Nx features</a
     >
   </li>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:19:39
 <ul>
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"
-      >10-minute video showing all Nx features</a
-    >
-  </li>
-  <li>
-    <a href="https://nx.dev/angular/tutorial/01-create-application"
+      >10-minute video showing all Nx true="https://nx.dev/angular/tutorial/01-create-application"
       >Interactive tutorial</a
     >

[Survived] BinaryExpression
demo3/src/app/app.component.html:20:5
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"
       >10-minute video showing all Nx features</a
-    >
+    >=
   </li>
   <li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:20:5
   <li>
     <a href="https://nx.dev/angular/getting-started/what-is-nx"
       >10-minute video showing all Nx features</a
-    >
+    <=
   </li>
   <li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:22:6
       >10-minute video showing all Nx features</a
     >
   </li>
-  <li>
+  <li<=
     <a href="https://nx.dev/angular/tutorial/01-create-application"
       >Interactive tutorial</a

[Survived] BinaryExpression
demo3/src/app/app.component.html:22:3
       >10-minute video showing all Nx features</a
     >
   </li>
-  <li>
+  <=li>
     <a href="https://nx.dev/angular/tutorial/01-create-application"
       >Interactive tutorial</a

[Survived] ConditionalExpression
demo3/src/app/app.component.html:23:13
     >
   </li>
   <li>
-    <a href="https://nx.dev/angular/tutorial/01-create-application"
-      >Interactive tutorial</a
+    <a href=true tutorial</a
     >
   </li>

[Survived] ConditionalExpression
demo3/src/app/app.component.html:23:13
     >
   </li>
   <li>
-    <a href="https://nx.dev/angular/tutorial/01-create-application"
-      >Interactive tutorial</a
+    <a href=false tutorial</a
     >
   </li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:24:7
   </li>
   <li>
     <a href="https://nx.dev/angular/tutorial/01-create-application"
-      >Interactive tutorial</a
+      <=Interactive tutorial</a
     >
   </li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:24:7
   </li>
   <li>
     <a href="https://nx.dev/angular/tutorial/01-create-application"
-      >Interactive tutorial</a
+      >=Interactive tutorial</a
     >
   </li>

[Survived] BinaryExpression
demo3/src/app/app.component.html:25:5
   <li>
     <a href="https://nx.dev/angular/tutorial/01-create-application"
       >Interactive tutorial</a
-    >
+    >=
   </li>
 </ul>

[Survived] BinaryExpression
demo3/src/app/app.component.html:25:5
   <li>
     <a href="https://nx.dev/angular/tutorial/01-create-application"
       >Interactive tutorial</a
-    >
+    <=
   </li>
 </ul>

[Survived] BinaryExpression
demo3/src/app/app.component.html:27:1
       >Interactive tutorial</a
     >
   </li>
-</ul>
+>=/ul>
 

[Survived] BinaryExpression
demo3/src/app/app.component.html:27:1
       >Interactive tutorial</a
     >
   </li>
-</ul>
+<=/ul>
 
