[Killed] ObjectLiteral
demo3/src/app/app.component.ts:3:12
 import { Component } from '@angular/core';
 
-@Component({
-  selector: 'mutation-demo-root',
-  templateUrl: './app.component.html',
-  styleUrls: ['./app.component.scss']
-})
+@Component({})
 export class AppComponent {
   title = 'demo3';

[Survived] StringLiteral
demo3/src/app/app.component.ts:6:15
 @Component({
   selector: 'mutation-demo-root',
   templateUrl: './app.component.html',
-  styleUrls: ['./app.component.scss']
+  styleUrls: [""]
 })
 export class AppComponent {
