[Survived] BinaryExpression
apps/demo3/src/index.html:1:15
-<!DOCTYPE html>
+<!DOCTYPE html<=
 <html lang="en">
   <head>

[Survived] BinaryExpression
apps/demo3/src/index.html:1:15
-<!DOCTYPE html>
+<!DOCTYPE html>=
 <html lang="en">
   <head>

[Survived] ConditionalExpression
apps/demo3/src/index.html:2:12
 <!DOCTYPE html>
-<html lang="en">
-  <head>
-    <meta charset="utf-8" />
+<html lang=true="utf-8" />
     <title>Demo3</title>
     <base href="/" />

[Survived] ConditionalExpression
apps/demo3/src/index.html:2:12
 <!DOCTYPE html>
-<html lang="en">
-  <head>
-    <meta charset="utf-8" />
+<html lang=false="utf-8" />
     <title>Demo3</title>
     <base href="/" />

[Survived] BinaryExpression
apps/demo3/src/index.html:4:27
 <!DOCTYPE html>
 <html lang="en">
   <head>
-    <meta charset="utf-8" />
+    <meta charset="utf-8" *>
     <title>Demo3</title>
     <base href="/" />

[Survived] BinaryExpression
apps/demo3/src/index.html:4:28
 <!DOCTYPE html>
 <html lang="en">
   <head>
-    <meta charset="utf-8" />
+    <meta charset="utf-8" /<=
     <title>Demo3</title>
     <base href="/" />

[Survived] BinaryExpression
apps/demo3/src/index.html:5:17
 <html lang="en">
   <head>
     <meta charset="utf-8" />
-    <title>Demo3</title>
+    <title>Demo3<=/title>
     <base href="/" />
 

[Survived] BinaryExpression
apps/demo3/src/index.html:5:17
 <html lang="en">
   <head>
     <meta charset="utf-8" />
-    <title>Demo3</title>
+    <title>Demo3>=/title>
     <base href="/" />
 

[Survived] BinaryExpression
apps/demo3/src/index.html:6:20
   <head>
     <meta charset="utf-8" />
     <title>Demo3</title>
-    <base href="/" />
+    <base href="/" *>
 
     <meta name="viewport" content="width=device-width, initial-scale=1" />

[Survived] ConditionalExpression
apps/demo3/src/index.html:6:16
   <head>
     <meta charset="utf-8" />
     <title>Demo3</title>
-    <base href="/" />
-
-    <meta name="viewport" content="width=device-width, initial-scale=1" />
+    <base href=false="viewport" content="width=device-width, initial-scale=1" />
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>

[Survived] BinaryExpression
apps/demo3/src/index.html:8:74
     <title>Demo3</title>
     <base href="/" />
 
-    <meta name="viewport" content="width=device-width, initial-scale=1" />
+    <meta name="viewport" content="width=device-width, initial-scale=1" /<=
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>

[Survived] ConditionalExpression
apps/demo3/src/index.html:8:35
     <title>Demo3</title>
     <base href="/" />
 
-    <meta name="viewport" content="width=device-width, initial-scale=1" />
-    <link rel="icon" type="image/x-icon" href="favicon.ico" />
+    <meta name="viewport" content=true="icon" type="image/x-icon" href="favicon.ico" />
   </head>
   <body>

[Survived] ConditionalExpression
apps/demo3/src/index.html:9:22
     <base href="/" />
 
     <meta name="viewport" content="width=device-width, initial-scale=1" />
-    <link rel="icon" type="image/x-icon" href="favicon.ico" />
+    <link rel="icon" false href="favicon.ico" />
   </head>
   <body>

[Survived] ConditionalExpression
apps/demo3/src/index.html:9:47
     <base href="/" />
 
     <meta name="viewport" content="width=device-width, initial-scale=1" />
-    <link rel="icon" type="image/x-icon" href="favicon.ico" />
-  </head>
-  <body>
-    <mutation-demo-root></mutation-demo-root>
-  </body>
-</html>
+    <link rel="icon" type="image/x-icon" href=true
 

[Survived] BinaryExpression
apps/demo3/src/index.html:11:3
     <meta name="viewport" content="width=device-width, initial-scale=1" />
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>
-  <body>
+  >=body>
     <mutation-demo-root></mutation-demo-root>
   </body>

[Survived] BinaryExpression
apps/demo3/src/index.html:11:3
     <meta name="viewport" content="width=device-width, initial-scale=1" />
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>
-  <body>
+  <=body>
     <mutation-demo-root></mutation-demo-root>
   </body>

[Survived] BinaryExpression
apps/demo3/src/index.html:12:24
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>
   <body>
-    <mutation-demo-root></mutation-demo-root>
+    <mutation-demo-root>=</mutation-demo-root>
   </body>
 </html>

[Survived] BinaryExpression
apps/demo3/src/index.html:12:19
     <link rel="icon" type="image/x-icon" href="favicon.ico" />
   </head>
   <body>
-    <mutation-demo-root></mutation-demo-root>
+    <mutation-demo+root></mutation-demo-root>
   </body>
 </html>

[Survived] BinaryExpression
apps/demo3/src/index.html:13:3
   </head>
   <body>
     <mutation-demo-root></mutation-demo-root>
-  </body>
+  >=/body>
 </html>
 

[Survived] BinaryExpression
apps/demo3/src/index.html:13:3
   </head>
   <body>
     <mutation-demo-root></mutation-demo-root>
-  </body>
+  <=/body>
 </html>
 

[Survived] BinaryExpression
apps/demo3/src/index.html:14:1
   <body>
     <mutation-demo-root></mutation-demo-root>
   </body>
-</html>
+>=/html>
 

[Survived] BinaryExpression
apps/demo3/src/index.html:14:1
   <body>
     <mutation-demo-root></mutation-demo-root>
   </body>
-</html>
+<=/html>
 
