[Survived] ObjectLiteral
demo2/src/app/app.component.ts:3:12
 import { Component } from '@angular/core';
 
-@Component({
-  selector: 'mutation-demo-root',
-  template: '<h1> Welcome to demo2! </h1>',
-  // styleUrls: ['./app.component.scss']
-})
+@Component({})
 export class AppComponent {
   title = 'demo2';

[Survived] StringLiteral
demo2/src/app/app.component.ts:4:13
 import { Component } from '@angular/core';
 
 @Component({
-  selector: 'mutation-demo-root',
+  selector: "",
   template: '<h1> Welcome to demo2! </h1>',
   // styleUrls: ['./app.component.scss']

[Survived] StringLiteral
demo2/src/app/app.component.ts:5:13
 
 @Component({
   selector: 'mutation-demo-root',
-  template: '<h1> Welcome to demo2! </h1>',
+  template: "",
   // styleUrls: ['./app.component.scss']
 })

[Survived] StringLiteral
demo2/src/app/app.component.ts:9:11
   // styleUrls: ['./app.component.scss']
 })
 export class AppComponent {
-  title = 'demo2';
+  title = "";
 }
 
