[Survived] ObjectLiteral
demo2/src/environments/environment.ts:5:28
 // `ng build --prod` replaces `environment.ts` with `environment.prod.ts`.
 // The list of file replacements can be found in `angular.json`.
 
-export const environment = {
-  production: false
-};
+export const environment = {};
 
 /*

[Survived] BooleanSubstitution
demo2/src/environments/environment.ts:6:15
 // The list of file replacements can be found in `angular.json`.
 
 export const environment = {
-  production: false
+  production: true
 };
 
